In [1]:
import numpy as np 
import pandas as pd

In [12]:
data1 = {
    'Name' : ['Anu', 'Rani', 'Rohan', 'Mini', 'Rini'], 
    'Age' : [20,23,np.nan ,21,24], 
    'Gender' : ['f', 'm', 'm', np.nan, 'f'], 
    'Salary' : [25,np.nan ,30,40,45], 
    'Purchase' : ['y', 'n', 'y', 'n', 'y']
}

dummy = pd.DataFrame(data1)

In [13]:
dummy.head()

    Name   Age Gender  Salary Purchase
0    Anu  20.0      f    25.0        y
1   Rani  23.0      m     NaN        n
2  Rohan   NaN      m    30.0        y
3   Mini  21.0    NaN    40.0        n
4   Rini  24.0      f    45.0        y